# frozen_string_literal: true

# Taps
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/bundle"
tap "nicoverbruggen/homebrew-cask"
tap "stripe/stripe-cli"

# Binaries
brew "ack"
brew "adns"
brew "antigen"
brew "awscli"
brew "bash" # Latest Bash version
brew "bash-completion@2"
brew "bdw-gc"
brew "brotli"
brew "bintools"
brew "binwalk"
brew "bettertouchtool"
brew "cairo"
brew "coreutils" # Those that come with macOS are outdated
brew "dark-mode"
brew "direnv"
brew "dns2tcp"
brew "docker"
brew "docker-machine"
brew "dos2unix"
brew "fcrackzip"
brew "ffmpeg"
brew "freetype"
brew "fontconfig"
brew "gcc"
brew "gh"
brew "git"
brew "git-extras"
brew "git-flow"
brew "gitmoji"
brew "glib"
brew "gmp"
brew "gnupg"
brew "get-opt"
brew "gnu-sed"
brew "grep"
brew "graphite2"
brew "heroku"
brew "heroku-node"
brew "highlight"
brew "httpie"
brew "htop"
brew "hub"
brew "jasper"
brew "mackup"
brew "mas" # Mac App Store manager
brew "mailhog"
brew "mkcert"
brew "mysql"
brew "mysql-client"
brew "narwhal"
brew "node"
brew "openssl@1.1"
brew "pkg-config" # https://github.com/driesvints/dotfiles/issues/20
brew "postgresql"
brew "python@3.9"
brew "rbenv"
brew "ruby-build"
brew "readline"
brew "selfcontrol"
brew "stripe/stripe-cli/stripe"
brew "stripe/stripe-mock/stripe-mock"
brew "svn" # Needed to install fonts
brew "svgo"
brew "watchman"
brew "woff2"
brew "yarn"

# Spatie Medialibrary
brew "jpegoptim"
brew "optipng"
brew "pngquant"
brew "gifsicle"

# Development
brew "composer"
brew "imagemagick"
brew "meilisearch"
brew "nginx"
brew "node"

# Apps
cask "1password"
cask "alfred"
cask "graphql-playground"
cask "iterm2"
cask "brave-browser"
cask "caffeine"
cask "clickup"
cask "copyclip"
cask "discord"
cask "docker"
cask "figma"
cask "github"
cask "gpg-suite"
cask "graphql-playground"
cask "helo"
cask "homebrew/cask-drivers/elgato-stream-deck"
cask "imageoptim"
cask "iterm2"
cask "krisp"
cask "libreoffice"
cask "ngrok"
cask "pastebot"
cask "postman"
cask "ray"
cask "screenflow"
cask "slack"
cask "spotify"
cask "tableplus"
cask "the-unarchiver"
cask "transmit"
cask "visual-studio-code"
cask "vlc"
cask "zoom"

# Quicklook
cask "qlmarkdown"
cask "quicklook-json"
cask "qlcolorcode"
cask "qlimagesize"
cask "qlmarkdown"
cask "qlprettypatch"
cask "qlstephen"
cask "qlvideo"
cask "quicklook-csv"
cask "quicklookase"
cask "webpquicklook"
cask "quartz"

# Fonts
cask "font-lato"
cask "font-open-sans"
cask "font-roboto"
cask "font-source-code-pro-for-powerline"
cask "font-source-code-pro"
cask "font-source-sans-pro"
cask "font-source-serif-pro"

# Mac App Store
mas "Byword", id: 420_212_497
mas "Giphy Capture", id: 668_208_984
mas "Keynote", id: 409_183_694
mas "Numbers", id: 409_203_825
mas "Spark", id: 1_176_895_641
mas "Speedtest", id: 1_153_157_709
mas "Things", id: 904_280_696
mas "Tweetbot", id: 1_384_080_005
